Repository: thaihuynhxyz/weather_app
Catalog: lib/l10n/arb/app_*.arb
Languages: vi

# weatherAppBarTitle
source: Weather
vi: Thời tiết

# weatherClearSky
source: Clear sky
vi: Trời quang

# weatherMainlyClear
source: Mainly clear, partly cloudy, and overcast
vi: Trời quang, mây rải rác và trời âm u

# weatherFog
source: Fog and depositing rime fog
vi: Sương mù và sương giá

# weatherDrizzle
source: Drizzle: Light, moderate, and dense intensity
vi: Mưa phùn: nhẹ, vừa và mạnh

# weatherFreezingDrizzle
source: Freezing drizzle: Light, moderate, and dense intensity
vi: Mưa phùn đóng băng: nhẹ, vừa và mạnh

# weatherRain
source: Rain: Light, moderate, and heavy intensity
vi: Mưa: nhẹ, vừa và mạnh

# weatherFreezingRain
source: Freezing Rain: Light and heavy intensity
vi: Mưa đá: nhẹ và mạnh

# weatherSnow
source: Snow fall: Slight, moderate, and heavy intensity
vi: Tuyết rơi: nhẹ, vừa và mạnh

# weatherSnowGrains
source: Snow grains
vi: Tuyết rơi nhẹ

# weatherRainShowers
source: Rain showers: Slight, moderate, and violent
vi: Mưa rào: nhẹ, vừa và mạnh

# weatherSnowShowers
source: Snow showers slight and heavy
vi: Mưa tuyết nhẹ và mạnh

# weatherThunderstorm
source: Thunderstorm: Slight or moderate
vi: Bão: nhẹ hoặc vừa

# weatherThunderstormWithHail
source: Thunderstorm with slight and heavy hail
vi: Bão kèm mưa đá nhẹ và mạnh

source: No data
vi: Không có dữ liệu
